import { useState } from 'react';
import Calendar from 'react-calendar';
import { useTranslation } from 'react-i18next';
import './../../i18next';
import 'react-calendar/dist/Calendar.css';
import styles from './CalendarComponent.module.scss';
import { useInView } from 'react-intersection-observer';

export const CalendarComponent = () => {
  const [value, onChange] = useState(new Date());
  const { t } = useTranslation();
  const [ref, inView] = useInView({
    triggerOnce: true, // Опция, чтобы анимация сработала только один раз
  });

  const holidays = {
    '2023-10-30': 'Осенние каникулы',
    '2023-10-31': 'Осенние каникулы',
    '2023-11-01': 'Осенние каникулы',
    '2023-11-02': 'Осенние каникулы',
    '2023-11-03': 'Осенние каникулы',
    '2023-11-04': 'Осенние каникулы',
    '2023-11-05': 'Осенние каникулы',
    '2023-12-29': 'Зимние каникулы',
    '2023-12-30': 'Зимние каникулы',
    '2023-12-31': 'Зимние каникулы',
    '2024-01-01': 'Зимние каникулы',
    '2024-01-02': 'Зимние каникулы',
    '2024-01-03': 'Зимние каникулы',
    '2024-01-04': 'Зимние каникулы',
    '2024-01-05': 'Зимние каникулы',
    '2024-01-06': 'Зимние каникулы',
    '2024-01-07': 'Зимние каникулы',
    '2024-02-05': 'Каникулы для первых классов',
    '2024-02-06': 'Каникулы для первых классов',
    '2024-02-07': 'Каникулы для первых классов',
    '2024-02-08': 'Каникулы для первых классов',
    '2024-02-09': 'Каникулы для первых классов',
    '2024-02-10': 'Каникулы для первых классов',
    '2024-02-11': 'Каникулы для первых классов',
    '2024-03-21': 'Весенние каникулы',
    '2024-03-22': 'Весенние каникулы',
    '2024-03-23': 'Весенние каникулы',
    '2024-03-24': 'Весенние каникулы',
    '2024-03-25': 'Весенние каникулы',
    '2024-03-26': 'Весенние каникулы',
    '2024-03-27': 'Весенние каникулы',
    '2024-03-28': 'Весенние каникулы',
    '2024-03-29': 'Весенние каникулы',
    '2024-03-30': 'Весенние каникулы',
    '2024-03-31': 'Весенние каникулы',
    '2024-05-26': 'Летние каникулы',
    '2024-05-27': 'Летние каникулы',
    '2024-05-28': 'Летние каникулы',
    '2024-05-29': 'Летние каникулы',
    '2024-05-30': 'Летние каникулы',
    '2024-05-31': 'Летние каникулы',
    '2024-06-01': 'Летние каникулы',
    '2024-06-02': 'Летние каникулы',
    '2024-06-03': 'Летние каникулы',
    '2024-06-04': 'Летние каникулы',
    '2024-06-05': 'Летние каникулы',
    '2024-06-06': 'Летние каникулы',
    '2024-06-07': 'Летние каникулы',
    '2024-06-08': 'Летние каникулы',
    '2024-06-09': 'Летние каникулы',
    '2024-06-10': 'Летние каникулы',
    '2024-06-11': 'Летние каникулы',
    '2024-06-12': 'Летние каникулы',
    '2024-06-13': 'Летние каникулы',
    '2024-06-14': 'Летние каникулы',
    '2024-06-15': 'Летние каникулы',
    '2024-06-16': 'Летние каникулы',
    '2024-06-17': 'Летние каникулы',
    '2024-06-18': 'Летние каникулы',
    '2024-06-19': 'Летние каникулы',
    '2024-06-20': 'Летние каникулы',
    '2024-06-21': 'Летние каникулы',
    '2024-06-22': 'Летние каникулы',
    '2024-06-23': 'Летние каникулы',
    '2024-06-24': 'Летние каникулы',
    '2024-06-25': 'Летние каникулы',
    '2024-06-26': 'Летние каникулы',
    '2024-06-27': 'Летние каникулы',
    '2024-06-28': 'Летние каникулы',
    '2024-06-29': 'Летние каникулы',
    '2024-06-30': 'Летние каникулы',
    '2024-07-01': 'Летние каникулы',
    '2024-07-02': 'Летние каникулы',
    '2024-07-03': 'Летние каникулы',
    '2024-07-04': 'Летние каникулы',
    '2024-07-05': 'Летние каникулы',
    '2024-07-06': 'Летние каникулы',
    '2024-07-07': 'Летние каникулы',
    '2024-07-08': 'Летние каникулы',
    '2024-07-09': 'Летние каникулы',
    '2024-07-10': 'Летние каникулы',
    '2024-07-11': 'Летние каникулы',
    '2024-07-12': 'Летние каникулы',
    '2024-07-13': 'Летние каникулы',
    '2024-07-14': 'Летние каникулы',
    '2024-07-15': 'Летние каникулы',
    '2024-07-16': 'Летние каникулы',
    '2024-07-17': 'Летние каникулы',
    '2024-07-18': 'Летние каникулы',
    '2024-07-19': 'Летние каникулы',
    '2024-07-20': 'Летние каникулы',
    '2024-07-21': 'Летние каникулы',
    '2024-07-22': 'Летние каникулы',
    '2024-07-23': 'Летние каникулы',
    '2024-07-24': 'Летние каникулы',
    '2024-07-25': 'Летние каникулы',
    '2024-07-26': 'Летние каникулы',
    '2024-07-27': 'Летние каникулы',
    '2024-07-28': 'Летние каникулы',
    '2024-07-29': 'Летние каникулы',
    '2024-07-30': 'Летние каникулы',
    '2024-07-31': 'Летние каникулы',
    '2024-08-01': 'Летние каникулы',
    '2024-08-02': 'Летние каникулы',
    '2024-08-03': 'Летние каникулы',
    '2024-08-04': 'Летние каникулы',
    '2024-08-05': 'Летние каникулы',
    '2024-08-06': 'Летние каникулы',
    '2024-08-07': 'Летние каникулы',
    '2024-08-08': 'Летние каникулы',
    '2024-08-09': 'Летние каникулы',
    '2024-08-10': 'Летние каникулы',
    '2024-08-11': 'Летние каникулы',
    '2024-08-12': 'Летние каникулы',
    '2024-08-13': 'Летние каникулы',
    '2024-08-14': 'Летние каникулы',
    '2024-08-15': 'Летние каникулы',
    '2024-08-16': 'Летние каникулы',
    '2024-08-17': 'Летние каникулы',
    '2024-08-18': 'Летние каникулы',
    '2024-08-19': 'Летние каникулы',
    '2024-08-20': 'Летние каникулы',
    '2024-08-21': 'Летние каникулы',
    '2024-08-22': 'Летние каникулы',
    '2024-08-23': 'Летние каникулы',
    '2024-08-24': 'Летние каникулы',
    '2024-08-25': 'Летние каникулы',
    '2024-08-26': 'Летние каникулы',
    '2024-08-27': 'Летние каникулы',
    '2024-08-28': 'Летние каникулы',
    '2024-08-29': 'Летние каникулы',
    '2024-08-30': 'Летние каникулы',
    '2024-08-31': 'Летние каникулы',
  };
  const kazakhstanTimeZone = 'Asia/Almaty';

  const tileContent = ({ date, view }) => {
    if (view === 'month') {
      const dateZone = date.toLocaleDateString(undefined, { timeZone: kazakhstanTimeZone });
      const [day, month, year] = dateZone.split('.');
      const formattedDate = `${year}-${month}-${day}`;
      if (formattedDate in holidays) {
        return <p className={styles.holidays}></p>;
        //return <p className={styles.holidays}>{holidays[formattedDate]}</p>;
      }
    }
    return null;
  };

  const tileClassName = ({ activeStartDate, date, view }) => {
    if (view === 'month') {
      const dateZone = date.toLocaleDateString(undefined, { timeZone: kazakhstanTimeZone });
      const [day, month, year] = dateZone.split('.');
      const formattedDate = `${year}-${month}-${day}`;
      if (formattedDate in holidays) {
        return 'react-calendar__month-view__days__day--weekend';
      }
    }
    return null;
  };

  return (
    <div className="container">
      <div className={`${styles.root} ${inView ? styles.visible : ''}`} ref={ref}>
        <h2 className={styles.title}>{t('calendar.title')}</h2>
        <div className={styles.wrapper}>
          <ul>
            <li>
              {t('calendar.autumn.name')}: <br /> {t('calendar.autumn.dates')}
            </li>
            <li>
              {t('calendar.winter.name')}: <br /> {t('calendar.winter.dates')}
            </li>
            <li>
              {t('calendar.spring.name')}: <br /> {t('calendar.spring.dates')}
            </li>
            <li>
              {t('calendar.summer.name')}: <br /> {t('calendar.summer.dates')}
            </li>
            <li>
              {t('calendar.additionalFirstGrade.name')}: <br />{' '}
              {t('calendar.additionalFirstGrade.dates')}
            </li>
          </ul>
          <Calendar
            onChange={onChange}
            value={value}
            tileContent={tileContent}
            tileClassName={tileClassName}
            locale="ru"
          />
        </div>
      </div>
    </div>
  );
};
